{
  "good morning": "Very good Morning! how are you today?",
  "hi": "Hi there! how can i assist you?",
  "hello": "Hello! how can i help you today?",
  "how are you": "i'm a bot, but i'm functioning well, thank you!",
  "bye": "goodbye! Take care and see you soon!",
  "how's everything going?": "i'm doing great, thanks for asking!",
  "i need your help": "how can i help you? Feel free to ask!",
  "i'm interested to learn react":"That's great!!",
  "where would you like to begin? basic or advanced topics?": "Absolutely! We can start with the basics or dive deep into advanced concepts.",
  "what's up?": "Not much! what can i do for you today?",
  "what can i help you with today?": "i'm here for anything you need! what's on your mind?",
  "let's get started!": "Great! let's dive right in. what would you like to explore?",
  "thank you": "You're very welcome! Let me know if you need anything else.",
  "can you assist me with something?": "Of course! what do you need help with?",
  "i'm busy right now": "No worries! Reach out whenever you're ready.",
  "have a great day!": "You too! Hope it's a fantastic day ahead.",
  "long time no see!": "Welcome back! how's everything going?",
  "what's new with you?": "i'm always up-to-date, ready to assist you anytime!",
  "can you help me solve a problem?": "Definitely! what's the problem? let's work through it together.",
  "it's nice to meet you!": "Nice to meet you too! how can i help you today?",
  "good to see you!": "good to see you too! how can i assist?",
  "give me a route map to learn react": [
    "Day 1: Setup: install Node.js & Create react App, JSX syntax, Functional Components, Props, useState Hook, Build Simple Counter App",
    "Day 2: Core Concepts: Conditional rendering, List rendering with .map(), Event handling, basic styling (CSS Modules or inline styles), Build: Todo List",
    "Day 3: State & Effects: State lifting (parent-child communication), Forms (controlled components), useEffect for side effects (e.g., APi calls), Build Weather App using APi",
    "Day 4: Routing: install react-router-dom, Setup routes and navigation, Dynamic routes with useParams, Build Multi-page Blog Layout",
    "Day 5: Advanced Hooks & Context: useContext for global state, useReducer basics, Create and use custom hooks, Upgrade Add Context to Todo or Blog App",
    "Day 6: Mini Project: Build a complete small app: Expense Tracker / Notes App / Movie Search, Use routing, state, APi, and styling together",
    "Day 7: Polish & Deploy: Organize components, Lazy loading (react.lazy), Deploy with Vercel or Netlify, Add loading/error states",
    "Day 8: Advanced react Features: Higher-order components (HOCs), Render props, Error boundaries, Build a Quiz App with HOC",
    "Day 9: Testing in react: Unit testing with Jest and react Testing Library, Mocking APis, Test coverage, Write test cases for Weather App",
    "Day 10: Optimization & Performance: Code splitting, Memoization with useMemo and useCallback, Virtualization, Build a fast-loading Dashboard",
    "Day 11: TypeScript with react: introduction to TypeScript, Types for react components, TSX, Add TypeScript to react App, Refactor Todo App to TypeScript",
    "Day 12: Styling Libraries: Learn Tailwind CSS, Emotion, or styled-components for scoped styling, Refactor components to use styled-components",
    "Day 13: APi integration: Authentication and Authorization with JWT, OAuth2, APi integration with backend, Build a Login system",
    "Day 14: Next Steps: PWA (Progressive Web App), Service workers, Offline storage, SEO, Accessibility, Add PWA features to Weather App"
  ],
  "examples of small react apps": [
    "Simple To-Do App: A simple app to add and remove tasks, using useState and basic styling.",
    "Weather App: An app that fetches data from a weather APi, displaying temperature, condition, and more.",
    "Expense Tracker: Keep track of your income and expenses, categorize them, and display charts.",
    "Movie Search App: Search for movies by title using the OMDB APi.",
    "Blog App with Authentication: Allow users to log in and create posts. Use react router for navigation and state management.",
    "Music Player: Build a simple music player app with play, pause, and skip functionality.",
    "Recipe Finder: A small app that fetches recipes from an APi based on user input for ingredients.",
    "Budget Planner: A basic app to plan and track your budget with categories for expenses.",
    "Personal Portfolio: Build a personal website to showcase your react skills and projects.",
    "Chat Application: A simple chat app where users can send messages in real-time using Firebase."
  ],
  "resources for learning react": [
    "Official react Docs: https://reactjs.org/docs/getting-started.html",
    "FreeCodeCamp react Tutorial: https://www.freecodecamp.org/learn/front-end-libraries/react/",
    "Codecademy react Course: https://www.codecademy.com/learn/react-101",
    "react for Beginners by Wes Bos: https://reactforbeginners.com/",
    "reactJS: A Complete Guide by Maximilian Schwarzmüller (Udemy): https://www.udemy.com/course/react-the-complete-guide-incl-redux/",
    "react - The Road to Learn react: https://www.roadtoreact.com/",
    "Egghead.io react Courses: https://egghead.io/courses/react",
    "Scrimba react Tutorial: https://scrimba.com/learn/learnreact",
    "The Complete react Developer Course (w/ Hooks and Redux) by Andrew Mead (Udemy): https://www.udemy.com/course/react-2nd-edition/",
    "react Native Documentation: https://reactnative.dev/docs/getting-started"
  ],
  "common react mistakes to avoid": [
    "Forgetting to return JSX in a functional component.",
    "Using the index as a key in lists, which can lead to performance issues and incorrect Ui updates.",
    "Not properly managing state, leading to unnecessary re-renders or inconsistent data.",
    "Directly modifying state without using setState or the useState hook.",
    "Not using PropTypes or TypeScript for type checking in components.",
    "Overcomplicating components by not breaking them down into smaller reusable components.",
    "Not using memoization or useCallback when passing functions to child components, leading to unnecessary re-renders.",
    "Not properly handling side effects with useEffect or other state management tools.",
    "ignoring accessibility (a11y) when building react applications."
  ],
  "how to improve react performance": [
    "Use react.memo to prevent unnecessary re-renders of functional components.",
    "Optimize rendering with useCallback and useMemo hooks.",
    "Use Lazy Loading (react.lazy) and Suspense to split code and load only the necessary parts of your app.",
    "implement code-splitting using react's built-in features or libraries like react Loadable.",
    "Avoid anonymous functions in JSX, as they are created on each render.",
    "Optimize list rendering by using the key prop correctly and avoiding complex items as keys.",
    "Use the react Profiler to identify performance bottlenecks in your application.",
    "Leverage PureComponent or shouldComponentUpdate for class components to prevent unnecessary re-renders."
  ],
  "best practices for writing react code": [
    "Keep components small and focused on a single responsibility.",
    "Write clean and maintainable code by following a consistent naming convention.",
    "Use functional components with hooks rather than class components.",
    "Avoid using setState in the constructor, instead initialize state directly in the class or use useState hook.",
    "Make use of PropTypes or TypeScript to enforce type checking.",
    "Use destructuring to make code more readable, especially when working with props or state.",
    "Use controlled components for form elements to handle input and validation.",
    "Keep state as simple as possible, and lift state up when needed to allow for component communication.",
    "Separate concerns by organizing your project structure with a feature-based approach."
  ],
   "how do i start with react?": "To get started with react, first install Node.js, then create a react app using Create react App. Learn JSX, components, props, and state, and start building simple apps like a counter or to-do list.",
  "what are props in react?": "Props (short for properties) are used to pass data from a parent component to a child component. They are read-only and help make components reusable and dynamic.",
  "what is the virtual dom in react?": "The virtual dom is a lightweight copy of the actual dom. react uses it to optimize updates to the Ui by only making changes where necessary, instead of updating the entire dom each time.",
  "what is the difference between state and props in react?": "State is used to store data that can change over time and affects the component’s behavior or appearance, while props are used to pass data from one component to another and are immutable within the component receiving them.",
  "what is jsx?": "JSX is a syntax extension for JavaScript that allows you to write HTML-like code inside JavaScript. it is then transformed into JavaScript by a compiler like Babel. it makes react code easier to write and understand.",
  "what is a functional component?": "A functional component is a simple JavaScript function that returns JSX. it can use hooks like useState and useEffect to manage state and side effects, respectively.",
  "what is a class component?": "A class component is a more traditional way of creating components in react. it uses ES6 classes and has lifecycle methods like componentDidMount, componentDidUpdate, and componentWillUnmount.",
  "what is the difference between usestate and useeffect?": "useState is a hook used for managing state within a functional component, while useEffect is used for managing side effects like data fetching, subscriptions, or manually changing the dom.",
  "what is react router?": "react router is a library that enables navigation between different views or pages in a react app. it uses components like `<Route>` and `<Link>` to manage routing.",
  "what is usecontext in react?": "useContext is a hook that allows you to access the value of a context directly within a component. it’s used for state management and avoids prop drilling by providing a global state across the component tree.",
  "what is the usereducer hook?": "useReducer is similar to useState but gives more control over state logic by using a reducer function. it is ideal for handling complex state logic and for situations where state updates depend on previous state values.",
  "how do i fetch data in react?": "You can use the useEffect hook combined with fetch() or Axios to make APi requests in react. Once the data is retrieved, you can store it in the component’s state using useState.",
  "what is the role of keys in react lists?": "Keys help react identify which items have changed, been added, or removed from a list. They improve performance by enabling react to re-render only the necessary components.",
  "how do i handle forms in react?": "in react, forms are usually handled as controlled components, where form data is managed by the component’s state. You can use the useState hook to manage the form input values and handle form submission.",
  "what is proptypes in react?": "PropTypes is a tool for checking the types of props passed to a component. it helps ensure that the correct type of data is being passed, and is useful for development and debugging.",
  "what are higher-order components?": "Higher-order components are functions that take a component and return a new component with additional props or functionality. They are useful for reusing logic across multiple components.",
  "how can i optimize react performance?": "You can optimize react performance by using react.memo to prevent unnecessary re-renders, using useCallback and useMemo hooks to optimize function and value passing, and lazy loading components using react.lazy.",
  "what is TypeScript and why should i use it with react?": "TypeScript is a superset of JavaScript that adds static typing to your code. it helps catch errors early during development, improves code quality, and enhances tooling support, making it a great choice for large react apps.",
  "what is a react lifecycle method?": "react lifecycle methods are special methods in class components that allow you to run code at specific points in a component's life, such as when it's mounted, updated, or unmounted.",
  "how do i use async/await in react?": "You can use async/await within react components by defining an asynchronous function inside the useEffect hook or other event handlers. it's commonly used for handling asynchronous operations like APi calls.",
  "what is a controlled component in react?": "A controlled component is a form element whose value is controlled by react state. it’s the preferred way to handle form inputs as it gives you full control over the data.",
  "how can i handle error boundaries in react?": "Error boundaries are react components that catch JavaScript errors in their child component tree, log those errors, and display a fallback Ui instead of crashing the app.",
  "what is the Context APi in react?": "The Context APi is a way to share values between components without having to explicitly pass props through every level of the tree. it’s useful for global states like themes, authentication, or user preferences.",
  "have you heard any good jokes lately?":" Yep! Why don't skeletons fight each other? Because they don't have the guts!",
  "Got any ideas for a fun weekend activity?":"how about hiking, checking out a new coffee shop, or maybe even visiting a museum? Or if you want something chill, a board game night could be a blast!",
  "what's a cool movie to watch tonight?":"if you're in the mood for a thriller, inception is a solid pick. if you’re feeling nostalgic, The Princess Bride is a classic.",
  "any recommendations for a good podcast?":"if you're into true crime, My Favorite Murder is super popular. For something light and funny, The Daily Show Podcast is always a good laugh!",
  "can you explain how http and https differ?":"Sure! HTTP (HyperText Transfer Protocol) is a protocol used for transmitting data over the web. HTTPS (HyperText Transfer Protocol Secure) is the secure version, encrypting the data between your browser and the server using SSL/TLS to prevent interception by attackers.",
  "how does a machine learning model learn from data?":"in machine learning, a model learns by analyzing data to recognize patterns. it adjusts its internal parameters (weights) to minimize errors in its predictions. This process, called training, uses algorithms like gradient descent to optimize the model over multiple iterations.",
  "what’s the difference between a relational database and a Nosql database?":"A relational database (like Mysql or Postgresql) stores data in tables with predefined schemas and relationships between tables. Nosql databases (like MongoDB or Cassandra) are more flexible, allowing for unstructured or semi-structured data, and are often used for large-scale, distributed applications.",
  "how does a virtual machine (vm) differ from a container?":" A VM runs an entire operating system and is virtualized at the hardware level, whereas containers share the host operating system’s kernel and are isolated at the application level. Containers are more lightweight and efficient than VMs because they don’t require full operating system overhead.",
  "what are the key differences between agile and waterfall project management methodologies?":"Agile is an iterative approach where teams work in sprints and continuously adjust to feedback, making it flexible. Waterfall, on the other hand, is a linear, sequential process where each phase is completed before moving on to the next, making it rigid but structured.",
  "what is an api?":"An APi lets different software applications communicate with each other.",
  "what’s the purpose of html?":"HTML structures content on the web.",
  "what is cloud computing?":"Cloud computing lets you store and access data online.",
  "what does http stand for?":"HyperText Transfer Protocol, the foundation of web communication.",
  "what’s a vpn?":" A VPN keeps your internet connection secure and private.",
  "class": "A blueprint for creating objects.",
  "object": "An instance of a class.",
  "interface": "A contract for classes to implement.",
  "polymorphism": "The ability to take many forms.",
  "inheritance": "The mechanism to derive a new class from an existing class.",
  "encapsulation": "Hiding the internal details of a class.",
  "abstraction": "Hiding complex implementation details and showing only the necessary features.",
  "overloading": "Defining multiple methods with the same name but different parameters.",
  "overriding": "Providing a new implementation for a method in a subclass.",
  "static": "A keyword indicating class-level properties or methods.",
  "final": "A keyword indicating constants, methods, or classes that cannot be modified.",
  "void": "A return type indicating no return value.",
  "package": "A namespace used to organize classes and interfaces.",
  "array": "A collection of elements of the same type.",
  "exception": "An event that disrupts the normal flow of a program.",
  "thread": "A single unit of execution in a program.",
  "lambda": "A shorthand for defining anonymous functions in Java.",
  "string": "A sequence of characters.",
  "hashmap": "A collection that stores key-value pairs.",
  "runnable": "An interface used to represent a task that can be executed by a thread.",
  "system": "A class that provides access to system resources.",
  "serializable": "An interface indicating that an object can be converted to a byte stream.",
  "jvm": "Java Virtual Machine, the engine that runs Java bytecode.",
  "jdk": "Java Development Kit, a set of tools for developing Java applications.",
  "jre": "Java Runtime Environment, a package that provides libraries and components to run Java programs.",
  "abstract": "A keyword for declaring an abstract class or method.",
  "synchronized": "A keyword to ensure that a method or block of code is accessed by only one thread at a time.",
  "enum": "A special class that represents a group of constants.",
  "constructor": "A special method used to initialize objects.",
  "super": "A keyword used to refer to the parent class.",
  "this": "A keyword referring to the current instance of the class.",
  "yield": "A keyword used to pause a thread and allow other threads to execute.",
  "finalize": "A method called before an object is destroyed by the garbage collector.",
  "assertion": "A statement used to test assumptions in the code.",
  "clone": "A method used to create a copy of an object.",
  "default": "A keyword used to specify a default method in an interface.",
  "access": "The ability to interact with fields or methods in a class.",
  "return": "A statement used to return a value from a method.",
  "try": "A block used to handle exceptions in Java.",
  "catch": "A block used to catch exceptions in Java.",
  "finally": "A block that always executes after a try-catch block.",
  "throw": "A statement used to throw an exception.",
  "throws": "A keyword used to declare exceptions that a method might throw.",
  "what is node.js?": "Node.js is a JavaScript runtime built on Chrome's V8 JavaScript engine that allows you to run JavaScript on the server side.",
  "what is express.js?": "Express.js is a minimal and flexible Node.js web application framework that provides a robust set of features for building web and mobile applications.",
  "what is mongodb?": "MongoDB is a Nosql database that stores data in a flexible, JSON-like format. it's designed to handle large amounts of data and is commonly used in web applications.",
  "what is redux?": "Redux is a predictable state container for JavaScript apps, used to manage the state of an application in a central store, making it easier to reason about and debug.",
  "what is the difference between sql and nosql": "sql databases are relational and use structured query language for defining and manipulating data. Nosql databases are non-relational and store data in various formats like key-value pairs, documents, or graphs.",
  "what is the dom in web development?": "The dom (Document Object Model) is a programming interface for web documents. it represents the structure of a document as a tree of nodes, where each node corresponds to a part of the page.",
  "what is a restful api?": "A RESTful APi is an APi that follows the principles of Representational State Transfer (REST). it uses HTTP methods like GET, POST, PUT, DELETE, and PATCH for interacting with resources.",
  "what is graphql?": "GraphQL is a query language for APis and a runtime for executing those queries with your existing data. it allows clients to request specific data from the server and get only what they need.",
  "what is the difference between a get and post request?": "A GET request is used to retrieve data from the server, while a POST request is used to send data to the server, often to create or update a resource.",
  "what is cors?": "CORS (Cross-Origin Resource Sharing) is a security feature implemented by browsers to prevent malicious websites from accessing resources and data from a different domain without permission.",
  "what is docker?": "Docker is a platform that enables developers to package applications and their dependencies into containers, which can run consistently on any system.",
  "what is kubernetes?": "Kubernetes is an open-source platform for automating the deployment, scaling, and management of containerized applications, often used with Docker containers.",
  "what is webpack?": "Webpack is a popular JavaScript module bundler that bundles JavaScript files, CSS, and other assets, optimizing them for faster loading and better performance.",
  "what is babel?": "Babel is a JavaScript compiler that allows developers to write modern JavaScript (ES6 and beyond) and convert it into a backwards-compatible version for older browsers.",
  "what are npm and yarn?": "npm (Node Package Manager) and yarn are package managers for JavaScript, used to install, manage, and share dependencies for Node.js applications.",
  "what is the role of middleware in express?": "Middleware in Express.js is a function that receives the request and response objects and can modify them, perform operations, or pass control to the next middleware in the stack.",
  "what is jwt (json web token)?": "JWT is an open standard for securely transmitting information between parties as a JSON object. it's often used for authentication and authorization in web applications.",
  "what is oauth?": "OAuth is an open standard for authorization that allows third-party applications to access user data without exposing user credentials, typically using tokens.",
  "what is the difference between synchronous and asynchronous programming?": "Synchronous programming executes tasks sequentially, one after the other, while asynchronous programming allows tasks to run concurrently, making programs more efficient and responsive.",
  "what are Promises in javascript?": "A Promise in JavaScript is an object representing the eventual completion or failure of an asynchronous operation. it allows you to chain `.then()` and `.catch()` for handling the result or error.",
  "what are async and await in javascript?": "async and await are used for handling asynchronous code. async is used to declare a function as asynchronous, and await is used to wait for a Promise to resolve within an async function.",
  "what is typescript?": "TypeScript is a superset of JavaScript that adds static typing to the language, helping to catch errors at compile time and improving code quality and tooling support.",
  "what is the purpose of an index in a database?": "An index in a database is used to speed up the retrieval of rows from a table. it works by creating a data structure that allows for faster searching and sorting.",
  "what is sql injection?": "sql injection is a type of security vulnerability that occurs when an attacker is able to manipulate sql queries by injecting malicious code into the query string, potentially gaining unauthorized access to the database.",
  "what is tdd": "TDD is a software development methodology where tests are written before the code itself. Developers write a failing test, implement the code to pass the test, and then refactor the code.",
  "what is continuous integration (ci)?": "Continuous integration (Ci) is a practice in software development where code changes are frequently integrated into a shared repository, with automated builds and tests to detect issues early.",
  "what is continuous delivery (cd)?": "Continuous Delivery (CD) is a software development practice where code changes are automatically built, tested, and deployed to production after passing all stages of the pipeline.",
  "what is the difference between an abstract class and an interface in object-oriented programming?": "An abstract class is a class that cannot be instantiated and may contain both abstract and concrete methods. An interface is a contract that a class must adhere to but cannot contain any implementation of methods.",
  "what is dependency injection in programming?": "Dependency injection is a design pattern in which a class receives its dependencies from an external source, rather than creating them internally. it promotes loose coupling and easier testing.",
  "what is the solid principle?": "SOLiD is a set of five principles for object-oriented programming and design that helps to create more understandable, flexible, and maintainable code. it stands for Single Responsibility, Open/Closed, Liskov Substitution, interface Segregation, and Dependency inversion.",
  "what is mvc?": "MVC is a design pattern used for developing user interfaces. it divides an application into three interconnected components: Model (data), View (Ui), and Controller (logic) to separate concerns and make the code more manageable.",
  "what is the difference between var, let, and const in JavaScript?": "var declares a variable with function scope, let declares a block-scoped variable, and const declares a block-scoped variable whose value cannot be reassigned after initialization.",
  "what are closures in JavaScript?": "A closure is a function that has access to its own scope, the outer function’s scope, and the global scope, even after the outer function has finished executing.",
  "what is the spread operator in JavaScript?": "The spread operator (`...`) is used to unpack elements from an array or object and spread them into a new array or object. it's useful for cloning, merging, and destructuring.",
  "what is destructuring in JavaScript?": "Destructuring is a JavaScript syntax feature that allows you to unpack values from arrays or objects into individual variables, making your code more concise and readable.",
  "what is a promise chain in JavaScript?": "A promise chain is a sequence of `.then()` methods, where each `.then()` handles the result of the previous promise, allowing for cleaner, more manageable asynchronous code.",
  "what is Big O notation?": "Big O notation is used to describe the time or space complexity of an algorithm. it provides a way to measure the performance of an algorithm as the size of the input grows.",
  "what is an event loop in JavaScript?": "The event loop is a mechanism that allows JavaScript to handle asynchronous operations. it continuously checks the message queue and executes the code when the call stack is empty.",
  "what is memory leak in JavaScript?": "A memory leak in JavaScript occurs when the program allocates memory for objects but fails to release it when it’s no longer needed, leading to performance issues as the program runs longer.",
  "how are you? ":"i'm doing great, thanks for asking! how about you?",
  "how are you doing":"i'm doing great, thanks for asking! how about you?",
  "how are you going":"i'm doing great, thanks for asking! how about you?",
  "what’s up?":"Not much, just here and ready to chat! what's up with you?",
  "good evening":"good evening! Hope you're having a wonderful evening!",
  "good afternoon":"good afternoon! Hope you're having a wonderful afternoon!",
  "good night":"good night! Hope you're having a wonderful night!",
  "how do i deploy a react app?": "you can deploy a react app using platforms like vercel, netlify, or github pages. just build the app using `npm run build`, then follow the hosting platform’s steps to upload the build folder.",
  "what is a hook in react?": "a hook is a special function that lets you 'hook into' react features like state and lifecycle methods in functional components. common hooks include usestate, useeffect, and usecontext.",
  "difference between useeffect and componentdidmount?": "useeffect with an empty dependency array runs once after the component mounts, similar to componentdidmount in class components. however, useeffect can also track updates and unmounting.",
  "how do i handle errors in react?": "use error boundaries for ui errors in class components, try-catch for synchronous code, and `.catch()` for promise rejections. you can also use libraries like sentry for advanced error logging.",
  "can i use react with backend frameworks like django or express?": "yes, react can be used with any backend framework. typically, the backend serves an api, and react interacts with it using fetch or axios to get and send data.",
  "what is a spa (single page application)?": "a spa is a web application that loads a single html page and dynamically updates content without reloading the page, offering a smoother user experience.",
  "how do i manage large state in react apps?": "for large-scale state, consider using context api, redux, or zustand. each has its own advantages for global state management across components.",
  "what is hydration in react?": "hydration is the process where react attaches event listeners to server-rendered html on the client side, making it interactive after ssr (server-side rendering).",
  "What can you do?":"I'm here to help you with your questions, guide you through services, assist with orders, and provide support—just ask!",
  "are you a real person?": "I'm a virtual assistant powered by AI, here to help 24/7.",
  "can i talk to a human?": "Absolutely. Let me connect you to a customer service representative.",
  "where is my order?": "Please provide your order number, and I’ll check the status for you.",
  "how do i return an item?": "You can return items by visiting our Returns page and following the steps. Need help? I can guide you.",
  "what payment methods do you accept?": "We accept credit/debit cards, PayPal, Apple Pay, and Google Pay.",
  "i forgot my password. what should i do?": "Click Forgot Password on the login page to reset it. Need help? I can send you the link.",
  "how do i update my profile info?": "You can update your details under My Account > Profile Settings.",
  "i'm having trouble logging in.": "Let’s troubleshoot—have you tried resetting your password or clearing your browser cache?",
  "how do i book an appointment?": "You can book online via our website or tell me your preferred date and time, and I’ll assist.",
  "what insurance do you accept?": "We accept most major insurance providers. Would you like to check if yours is included?",
  "how do i check my balance?": "Log in to your account or use our mobile app. I can direct you to the login page if needed.",
  "how do i report a lost card?": "Please call our 24/7 hotline immediately or block the card via the app for security.",
  "what are your business hours?": "We’re open Monday–Friday, 9 AM to 6 PM. Support is available 24/7 online.",
  "do you offer support in other languages?": "Yes, we support multiple languages. Which one would you prefer?",
  "my product isn't working, what should i do?": "I’m sorry to hear that! Can you describe the issue, and I’ll try to help with troubleshooting steps?",
  "how do i install the product?": "You can find step-by-step installation instructions on our website or I can walk you through it.",
  "is there a user manual available?": "Yes, you can download the user manual from our support page or I can send you the link directly.",
  "can i update my billing information?": "Yes, you can update your billing details under 'Account Settings.' I can help you navigate to the correct page if you like.",
  "do you offer international shipping?": "Yes, we ship internationally. Please provide your country, and I can check shipping options for you.",
  "how can i track my shipment?": "If you provide me with your order number, I can show you the latest tracking details.",
  "how long does shipping take?": "Shipping times vary depending on your location. Standard shipping takes 3–5 business days, while expedited shipping can arrive in 1–2 days.",
  "can i exchange my product?": "Yes, we offer exchanges within 30 days of purchase. Would you like help starting an exchange request?",
  "how long does it take to process a refund?": "Refunds are usually processed within 5–7 business days, depending on your payment method.",
  "do i have to pay for return shipping?": "In most cases, the customer is responsible for return shipping. However, if the item is damaged or incorrect, we will cover the cost.",
  "the website isn’t loading. is there a problem?": "Sorry for the inconvenience. Let me check the status of our website for you... (provide real-time update, if possible).",
  "why is my order stuck in processing?": "Sometimes, this happens due to payment verification or high demand. Let me check your order status for you.",
  "why is the app crashing on my device?": "Try restarting the app and clearing the cache. If the issue persists, I can help guide you through troubleshooting steps or direct you to technical support.",
  "do you have any discounts or promotions?": "Yes! We currently have a sale running. Would you like to know more about our discounts or view our current offers?",
  "how do i use a promo code?": "At checkout, there’s a box where you can enter the promo code. Let me know if you need help applying it!",
  "can i get a price match on an item?": "We offer price matching for certain items. Please provide the details of the competitor's price, and we’ll verify if it qualifies.",
  "can i get same-day delivery?": "Same-day delivery is available in select areas. Please provide your location, and I’ll check if it’s available for you.",
  "how soon can i get a response from customer support?": "Our customer support team usually responds within 24 hours. If your issue is urgent, I can help connect you to someone right away.",
  "where are you located?": "We have multiple locations, but our headquarters is based in [City/Country]. Let me know if you’re looking for a specific location.",
  "can i leave a review for a product or service?": "Absolutely! You can leave a review on the product page, or I can provide you with a direct link to submit your feedback.",
  "do you offer gift cards?": "Yes, we offer gift cards! You can purchase them online, and I can send you the link to buy one.",
  "how can i get in touch with your support team?": "You can reach us via email at [email] or by calling [phone number]. Alternatively, I can direct you to live chat support.",
  "can i schedule a call with a representative?": "Sure! I can help you schedule a call with one of our representatives. When would be a convenient time for you?",
  "do you offer any loyalty or rewards program?": "Yes, we do! Our loyalty program allows you to earn points with every purchase, which can be redeemed for discounts or free products.",
  "how can i view my billing history?": "You can view your billing history under 'Account Settings' > 'Billing History.' Let me know if you need assistance finding it.",
  "can i change my subscription plan?": "Yes, you can change your subscription plan by going to 'Account Settings' > 'Subscription' and selecting the new plan.",
  "why was i charged twice?": "Double charges can happen due to a billing error or payment retry. I can help you review the charges if you provide the details.",
  "can i ship to a p.o. box?": "Yes, we can ship to a P.O. Box. If you're experiencing any issues, let me know, and I can assist further.",
  "what do i do if my package is lost?": "If your package is lost, please contact our support team immediately, or I can help start a claim for you.",
  "can i change the shipping address after placing an order?": "Shipping addresses can be updated if the order hasn’t been shipped yet. Provide your order number, and I’ll check if it's possible to make changes.",
  "how do i get a refund for a canceled order?": "Refunds for canceled orders are processed automatically. It can take up to 5 business days for the refund to reflect in your account.",
  "what do i do if i received a damaged item?": "If you received a damaged item, please contact us with photos of the damage, and we'll assist you with a return or exchange.",
  "can i return an item after 30 days?": "We generally accept returns within 30 days, but in some cases, we can make exceptions. Let me know the details, and I’ll check for you.",
  "the app isn’t updating, what can i do?": "Try closing and reopening the app, or check if there’s a pending update in your device’s app store. If the issue persists, I can guide you further.",
  "why is my payment not going through?": "It could be due to issues with your payment method, like an expired card or insufficient funds. Double-check your details, or I can assist in troubleshooting.",
  "i can’t access my account, what should i do?": "If you can’t access your account, try resetting your password. If that doesn’t work, I can help you with additional recovery steps.",
  "how can i get notified about new deals?": "You can sign up for our newsletter or follow us on social media to get updates on the latest deals and promotions.",
  "can i use multiple promo codes on one order?": "Only one promo code can be used per order, but I can help you find the best discount for your purchase.",
  "do you offer student discounts?": "Yes, we offer student discounts! If you qualify, I can guide you on how to apply it at checkout.",
  "do you have any physical stores?": "We currently operate online, but we may have a few partner locations depending on your region. Let me know if you'd like to find a nearby store.",
  "are your products eco-friendly?": "We’re committed to sustainability and offer a range of eco-friendly products. I can share more details or recommend eco-friendly items.",
  "can i use your services outside of [country]?": "Our services are available in [Country], but we may offer limited access in other regions. Let me know your location, and I can verify for you.",
  "how do i subscribe to your newsletter?": "You can subscribe to our newsletter by entering your email at the bottom of our homepage or I can send you the direct link.",
  "can i get a receipt for my purchase?": "You can view and download your receipt from the order confirmation page in your account, or I can send it to you directly.",
  "how do i change my username?": "You can change your username in your 'Account Settings.' If you need help, let me know, and I can guide you.",
   "how do i update my email address?": "You can update your email address in the 'Account Settings' section under 'Personal Information.' Let me know if you need help finding it.",
  "can i suspend my subscription for a while?": "We don’t currently offer subscription suspension, but you can cancel and re-subscribe at any time. Let me know if you’d like help with that.",
  "i didn’t receive an invoice for my purchase, where can i find it?": "You can download your invoice from the 'Order History' section in your account. If you can’t find it, I can send you the link.",
  "can i choose a specific delivery date?": "We offer scheduled delivery for certain locations. Let me know your preferred delivery date and location, and I can check availability.",
  "do you provide tracking for international orders?": "Yes, we provide tracking for international shipments. Once your order ships, you’ll receive an email with tracking information.",
  "can i change the shipping method after placing an order?": "If the order hasn’t shipped yet, we may be able to update the shipping method. Please provide your order number, and I’ll check for you.",
  "can i exchange an item for a different size?": "Yes, we offer size exchanges within 30 days of purchase. You can start an exchange by visiting the 'Returns' section of your account.",
  "how do i know if my return was approved?": "Once your return is processed, you’ll receive a confirmation email. You can also track the status under 'Order History.'",
  "do you charge restocking fees?": "We generally don’t charge restocking fees unless the product is damaged or missing parts. I can provide specific details if needed.",
  "the website isn’t responding, what should i do?": "Please try refreshing the page or clearing your browser cache. If the issue persists, let me know and I can check for any known outages.",
  "my password reset link isn’t working, what can i do?": "Make sure you’re using the correct email address. If the link still doesn’t work, I can help resend it or guide you through the process.",
  "why are the product images not loading?": "It could be a network issue or browser-related. Try refreshing the page or using a different browser. Let me know if that helps.",
  "are there any discounts for first-time customers?": "Yes, we offer a discount for first-time customers. You’ll receive the discount code after subscribing to our newsletter.",
  "can i combine a gift card with a promo code?": "Yes, you can use a gift card along with a promo code during checkout.",
  "are there any seasonal sales coming up?": "We typically have seasonal sales during holidays and special events. I can add you to our mailing list to keep you updated.",
  "can i buy a product without creating an account?": "Yes, you can check out as a guest. However, creating an account will allow you to track your orders and manage your subscriptions.",
  "do you have a mobile app?": "Yes, we have a mobile app available for both iOS and Android. I can send you the download link if needed.",
  "how can i find out if a product is in stock?": "You can check the availability of products on the product page. If an item is out of stock, you can sign up to be notified when it’s back.",
  "how do i cancel a scheduled delivery?": "If you need to cancel a scheduled delivery, please contact us as soon as possible, and we’ll try to reschedule it for you.",
  "can i gift wrap my order?": "Yes, we offer gift wrapping for an additional charge. You can select this option during checkout.",
  "do you offer a price match guarantee?": "Yes, we offer price matching on select products. If you find a lower price, let us know, and we’ll verify the details.",
   "how can i track my order?": "You can track your order by visiting the 'Order History' section in your account. I can provide you with a direct link to that page.",
  "what should i do if my order is delayed?": "If your order is delayed, please check the tracking details for an update. If there’s no update, let me know, and I can help escalate the issue.",
  "can i change my billing address after placing an order?": "If your order hasn’t shipped yet, we may be able to update the billing address. Please provide your order number, and I’ll check for you.",
  "how do i redeem a gift card?": "To redeem a gift card, enter the code at checkout in the gift card section. Let me know if you need help with this.",
  "can i check the balance of my gift card?": "Yes, you can check your gift card balance by visiting the 'Gift Cards' section in your account. If you need assistance, just let me know.",
  "how do i use my loyalty points?": "You can use your loyalty points during checkout. If you have points available, you'll see the option to apply them to your order.",
  "how do i change my shipping address?": "You can change your shipping address before the order is shipped. Please provide your order number, and I’ll check if we can make that change.",
  "how do i cancel my order?": "You can cancel your order as long as it hasn't been processed or shipped. Provide me with your order number, and I’ll assist you.",
  "what happens if my order is returned to sender?": "If your order is returned to sender, we will contact you to confirm your address and either resend the order or process a refund.",
  "do you ship to my country?": "We ship to many countries, but availability can depend on your location. Please provide your country, and I’ll confirm if we offer shipping to it.",
  "how long does it take to process an order?": "Order processing typically takes 1-2 business days. You’ll receive an email confirmation once your order has shipped.",
  "do you offer free shipping?": "We offer free shipping on orders over a certain amount. You can check the details on our shipping page or I can provide the current offer.",
  "how do i report a problem with my order?": "If you have an issue with your order, please contact our support team or provide me with the details, and I can help resolve it.",
  "how can i unsubscribe from your emails?": "You can unsubscribe by clicking the 'unsubscribe' link at the bottom of our emails. If you need help, I can assist with the process.",
  "do you offer a warranty on your products?": "Yes, we offer a warranty on many of our products. You can check the warranty details on the product page or I can provide more information.",
  "can i buy items in bulk?": "Yes, we offer bulk purchasing options. Let me know the items you're interested in, and I can provide bulk pricing details.",
  "can i get a discount for bulk purchases?": "We may offer discounts on bulk purchases. Please provide the details of what you’re buying, and I can check for available discounts.",
  "do you offer student or military discounts?": "Yes, we offer discounts for students and military members. I can guide you on how to apply these discounts at checkout.", 
  "how do i update my payment method?": "You can update your payment method in the 'Account Settings' section under 'Payment Methods.' I can assist you with that if needed.",
  "can i pay in installments?": "We offer installment payment options through third-party services like Klarna or Afterpay. Check the payment options at checkout or I can help with more details.",
  "how do i update my address?": "You can update your address in the 'Account Settings' under 'Personal Information.' I can assist you in finding it if needed.",
  "can i upgrade my subscription?": "Yes, you can upgrade your subscription plan by visiting the 'Subscription' section in your account settings.",
  "can i change the quantity of items in my cart?": "Yes, you can change the quantity by going to your shopping cart and adjusting the number. Let me know if you need further assistance.",
  "how do i cancel my subscription renewal?": "You can disable automatic renewal under 'Subscription Settings' in your account. I can help guide you through the steps.",
  "how do i check my order status?": "You can check your order status in the 'Order History' section. If you need help, I can send you a direct link.",
  "can i buy gift cards?": "Yes, you can purchase gift cards from our website. Let me know if you need a direct link.",
  "do you offer free returns?": "We offer free returns for defective or incorrect items. For other returns, you may need to pay for shipping. Let me know if you need more info.",
  "how do i track a shipment?": "Once your order is shipped, you will receive an email with tracking information. You can also track it under 'Order History'.",
  "can i pay with paypal?": "Yes, we accept PayPal as a payment method. Let me know if you need help during checkout.",
  "how can i apply a discount code?": "You can apply the discount code at checkout in the 'Promo Code' field. Let me know if you need help applying it.",
  "do you offer a money-back guarantee?": "Yes, we offer a 30-day money-back guarantee on most products. You can read the full policy on our website.",
  "can i change my order after it's placed?": "Once an order is placed, we may not be able to modify it. However, I can check for you if it's still possible to make changes.",
  "how do i contact customer support?": "You can contact customer support via email, phone, or live chat. I can provide you with the contact details.",
  "do you offer same-day delivery?": "Same-day delivery is available in select areas. Let me know your location, and I’ll check if it's available for you.",
  "can i use a gift card for my purchase?": "Yes, you can use a gift card at checkout. Simply enter the code in the 'Gift Card' section.",
  "how do i reset my password?": "To reset your password, click the 'Forgot Password' link on the login page. If you need assistance, I can help you reset it.",
  "can i return a product if i opened the packaging?": "You can return opened items if they are defective or incorrect. For other returns, please check our return policy for specific guidelines.",
  "how do i report an issue with my order?": "You can report an issue by contacting our customer support team or providing me with the order number, and I can assist you further.",
  "do you offer a loyalty program?": "Yes, we have a loyalty program where you earn points for each purchase, which can be redeemed for discounts. Let me know if you'd like to join.",
  "can i purchase items on a payment plan?": "We offer payment plans through third-party services like Klarna and Afterpay. You can choose this option at checkout if available.",
  "how do i view my billing history?": "You can view your billing history by going to 'Account Settings' > 'Billing History'. Let me know if you need help locating it.",
  "can i use multiple promo codes at checkout?": "You can only use one promo code per order. I can help you find the best code for your order.",
  "how do i update my credit card information?": "You can update your credit card details in the 'Payment Methods' section of your account settings. Let me know if you need help.",
  "how can i check if a product is in stock?": "You can check product availability on the product page. If an item is out of stock, you can sign up to be notified when it's available again.",
  "how do i delete my account?": "If you wish to delete your account, please contact customer support. I can assist you in contacting them.",
  "do you offer any discounts for new customers?": "Yes, we offer a discount for new customers. You’ll receive it when you sign up for our newsletter.",
  "can i track a return?": "Yes, you can track your return under 'Order History' in your account. Once the return is processed, you will see the status.",
  "how do i unsubscribe from your emails?": "To unsubscribe, click the 'unsubscribe' link at the bottom of our emails or I can assist you with the process.",
  "can i get a price adjustment if i find a lower price?": "We offer price adjustments within a certain timeframe after purchase. Let me know the details, and I’ll verify if you qualify.",
  "can i add items to an existing order?": "Unfortunately, once an order is placed, it cannot be modified. However, you can place a new order for any additional items you need.",
  "how do i update my personal information?": "You can update your personal information under 'Account Settings' > 'Personal Information'. Let me know if you need help with it.",
  "do you offer support in multiple languages?": "Yes, we support multiple languages. Let me know which one you prefer, and I’ll assist you accordingly.",
  "can i sign up using my google account?": "Yes, you can sign up using your Google account by selecting the 'Sign up with Google' option during the registration process.",
  "can i delete my account?": "Yes, you can delete your account by contacting our support team. They will guide you through the deletion process.",
  "how do i update my profile picture?": "To update your profile picture, go to 'Account Settings,' click on 'Profile,' and upload a new image.",
  "how do i add a shipping address?": "You can add a shipping address by going to 'Account Settings' > 'Shipping Addresses' and clicking 'Add New Address.'",
  "can i use a different email for my account?": "Yes, you can update your email address in 'Account Settings' under 'Personal Information.'",
  "how do i verify my email address?": "You will receive a verification email when you register. Simply click on the verification link to confirm your email.",
  "can i change my email address?": "Yes, you can change your email address in 'Account Settings' under 'Personal Information.'",
  "how do i track my shipment?": "You will receive a tracking number via email once your order ships. You can use this number to track your shipment on the carrier's website.",
  "can i add items to my order?": "Once an order is placed, it cannot be modified. However, you can place a new order for additional items.",
  "can i exchange an item?": "Yes, we offer exchanges within 30 days of purchase. Please check our 'Returns' page for more details on how to exchange an item.",
  "what is your return policy?": "Our return policy allows returns within 30 days of purchase. The item must be unused and in its original packaging.",
  "can i get a refund?": "Refunds are available for returned items within 5–7 business days after we receive the returned product.",
  "how do i cancel my subscription?": "To cancel your subscription, go to 'Account Settings' > 'Subscription' and select 'Cancel Subscription.'",
  "can i pause my subscription?": "We currently don’t offer the option to pause a subscription, but you can cancel and resubscribe anytime.",
  "how do i upgrade my subscription?": "You can upgrade your subscription by going to 'Account Settings' > 'Subscription' and selecting a higher tier.",
  "how do i add a new payment method?": "You can add a new payment method by going to 'Account Settings' > 'Payment Methods' and clicking 'Add New Payment Method.'",
  "how do i remove a payment method?": "To remove a payment method, go to 'Account Settings' > 'Payment Methods,' select the method you want to delete, and click 'Remove.'",
  "can i use a gift card?": "Yes, you can use a gift card during checkout by entering the card details in the payment section.",
  "can i combine multiple promo codes?": "We allow only one promo code per order. Choose the best code to apply for the maximum discount.",
  "how do i apply a discount code?": "During checkout, enter the promo code in the 'Discount Code' box, and click 'Apply.'",
  "how do i check if a product is in stock?": "You can check the availability of a product on its product page. If the product is out of stock, you can sign up to receive a notification when it’s available.",
  "how can i pre-order an item?": "If an item is available for pre-order, you can place an order by selecting the 'Pre-order' option on the product page.",
  "how do i find a product on the website?": "You can search for a product using the search bar at the top of the website or browse through categories.",
  "can i filter products by price?": "Yes, you can filter products by price range using the filters available on the left side of the product listing pages.",
  "can i opt out of promotional emails?": "Yes, you can opt out of promotional emails in your 'Account Settings' under 'Email Preferences.'",
  "how do i get notified about sales?": "You can sign up for our newsletter or follow us on social media to get updates on the latest sales and promotions.",
  "can i request a price match?": "Yes, we offer price matching on certain items. Please contact customer service with details of the competitor's price, and we’ll verify the match.",
  "how do i report a product issue?": "To report a product issue, please contact customer support with the product details and a description of the problem.",
  "can i leave a review for a product?": "Yes, you can leave a review by visiting the product page and submitting your feedback under the review section.",
  "how do i redeem my loyalty points?": "You can redeem your loyalty points during checkout. Just select the points option, and the discount will be applied automatically.",
  "how do i track my loyalty points?": "You can track your loyalty points in your 'Account Settings' under 'Loyalty Program.'",
  "can i transfer my loyalty points to someone else?": "Currently, loyalty points are non-transferable and can only be used on your account.",
  "do you offer a referral program?": "Yes, we have a referral program. You can refer a friend and earn rewards once they make a purchase. I can share the referral link if you'd like.",
  "how do i unsubscribe from your newsletter?": "To unsubscribe from our emails, click the 'Unsubscribe' link at the bottom of any of our emails.",
  "how do i report a faulty item?": "If you receive a faulty item, please contact us with a description and photos of the defect, and we will assist you with a return or replacement.",
  "what is your warranty policy?": "We offer a warranty on most of our products. Please check the product page for specific warranty details or contact customer service for more information.",
  "can i use my points for a discount on a sale item?": "Yes, you can use loyalty points on sale items, but the points may be limited in their application depending on the discount level.",
  "can i change my order after it's been placed?": "Once an order is placed, it cannot be modified. However, you can contact customer service to cancel and re-order.",
  "can i cancel my subscription at any time?": "Yes, you can cancel your subscription at any time through 'Account Settings' > 'Subscription.'",
  "how do i update my shipping address?": "You can update your shipping address under 'Account Settings' > 'Shipping Address.' Let me know if you need help finding it.",
  "can i change the payment method for my order?": "If your order hasn’t been processed yet, we may be able to change the payment method. Please provide your order number, and I’ll check for you.",
  "how do i know if my order has been shipped?": "Once your order is shipped, you’ll receive an email with tracking information. You can also check the status under 'Order History.'",
  "do you offer same-day shipping?": "We offer same-day shipping in certain locations. Let me know your location, and I can check if it's available for you.",
  "can i send my order to multiple addresses?": "Currently, we only allow one shipping address per order. If you need multiple addresses, you would need to place separate orders.",
  "how do i request a return label?": "You can request a return label by visiting the 'Returns' section in your account. If you need assistance, I can guide you through the process.",
  "how do i know if an item is eligible for a return?": "Items are eligible for return if they’re in unused condition and within the return window, typically 30 days from the purchase date.",
  "do you offer international returns?": "Yes, we accept returns internationally. You can follow the same return process, but shipping costs may apply for international returns.",
  "what should i do if my order is incomplete?": "If your order is incomplete, please contact our support team, or I can assist you with starting a claim for the missing items.",
  "can i change the billing address for my order?": "You can update your billing address during checkout. If the order has already been placed, please contact support to assist with changes.",
  "how can i get a discount on my next order?": "You can sign up for our newsletter or check for available promo codes before checkout. I can provide you with the latest offers if you like.",
  "can i apply a promo code after placing my order?": "Promo codes must be applied at checkout. Unfortunately, we cannot apply them after the order is placed, but I can help you apply a code on your next order.",
  "do you offer bulk purchasing discounts?": "Yes, we offer discounts for bulk purchases. Please contact our sales team with your order details, and they will provide a quote.",
  "can i change my password?": "You can change your password by going to 'Account Settings' > 'Security' and selecting 'Change Password.' Let me know if you need assistance.",
  "how do i recover my account if i forget my password?": "You can recover your account by clicking 'Forgot Password' on the login page. If you need help, I can send you a password reset link.",
  "how do i add a payment method?": "You can add a payment method under 'Account Settings' > 'Payment Methods.' Let me know if you need help with the process.",
  "how do i check my gift card balance?": "You can check your gift card balance by visiting the 'Gift Card' section under 'Account Settings.' If you need further help, I can assist you.",
  "can i add a note to my order?": "You can add a note to your order during checkout by using the 'Order Notes' section. Let me know if you need further assistance.",
  "how do i track my order?": "You can track your order through the tracking number sent to your email. Alternatively, provide me with your order number, and I can give you the status.",
  "what if i miss the delivery?": "If you miss the delivery, the carrier will typically attempt another delivery or hold your package at a local facility for pickup. Check the tracking info for specifics.",
  "can i cancel a return request?": "Once a return request is processed, it can’t be canceled. However, if it’s still pending, we might be able to assist you. Let me know if you need help.",
  "In which decade was the American Institute of Electrical Engineers (AIEE) founded?":"1880s",
  "What is part of a database that holds only one type of information?":"Field",
  "'OS' computer abbreviation usually means ?":"Operating System",
  "In which decade with the first transatlantic radio broadcast occur?":"1900s",
  "'.MOV' extension refers usually to what kind of file?":"Animation/movie file",
  "what is the capital of France?": "Paris",
  "how can I reset my password?": "To reset your password, click on the 'Forgot Password' link on the login page and follow the instructions sent to your email.",
  "when was the first moon landing?": "The first moon landing occurred on July 20, 1969, during the Apollo 11 mission.",
  "how do I update my billing address?": "You can update your billing address by going to the 'Account Settings' section and selecting 'Billing Information'.",
  "who was the first president of the United States?": "George Washington was the first president of the United States, serving from 1789 to 1797.",
  "what is the largest planet in our solar system?": "Jupiter is the largest planet in our solar system.",
  "how can I contact customer support?": "You can contact customer support via the 'Contact Us' page on our website, through email, or by calling our support line.",
  "what is the square root of 64?": "The square root of 64 is 8.",
  "what is the chemical symbol for water?": "The chemical symbol for water is H2O.",
  "how do I unsubscribe from your newsletter?": "To unsubscribe from our newsletter, click the 'unsubscribe' link at the bottom of any email you receive from us.",
  "when was the Eiffel Tower built?": "The Eiffel Tower was built from 1887 to 1889 for the 1889 Exposition Universelle (World's Fair) in Paris.",
  "how do I add a new payment method?": "To add a new payment method, go to 'Payment Methods' in your account settings and follow the prompts.",
  "what is the boiling point of water?": "The boiling point of water is 100°C (212°F) at sea level.",
  "who wrote the play 'Romeo and Juliet'?": "William Shakespeare wrote the play 'Romeo and Juliet' in 1595.",
  "how do I change my username?": "To change your username, go to 'Account Settings' and click 'Edit Profile'. You can then update your username.",
  "who discovered penicillin?": "Penicillin was discovered by Alexander Fleming in 1928.",
  "what is the speed of light?": "The speed of light is approximately 299,792 kilometers per second (186,282 miles per second).",
  "how do I update my shipping address?": "You can update your shipping address by going to 'Shipping Information' in your account settings.",
  "what is the largest ocean on Earth?": "The Pacific Ocean is the largest ocean on Earth.",
  "how do I redeem a gift card?": "To redeem a gift card, go to the 'Redeem Gift Card' section in your account settings and enter the code.",
  "what is the capital of Japan?": "Tokyo is the capital of Japan.",
  "how do I check the status of my return?": "You can check the status of your return by logging into your account and viewing the 'Returns' section.",
  "who painted the Mona Lisa?": "The Mona Lisa was painted by Leonardo da Vinci.",
  "what is the chemical symbol for gold?": "The chemical symbol for gold is Au.",
  "how do I change my email address?": "To change your email address, go to 'Account Settings' and update your email under 'Contact Information'.",
  "what is the fastest animal on land?": "The fastest land animal is the cheetah, capable of running up to 75 miles per hour (120 kilometers per hour).",
  "who was the first person to circumnavigate the globe?": "Ferdinand Magellan's expedition was the first to circumnavigate the globe, though Magellan himself did not complete the journey.",
  "how do I apply a promo code?": "To apply a promo code, enter the code in the 'Discount Code' field during checkout.",
  "what is the tallest mountain in the world?": "Mount Everest is the tallest mountain in the world, standing at 8,848.86 meters (29,031.7 feet) above sea level.",
  "how do I delete my account?": "To delete your account, go to 'Account Settings' and select 'Delete Account'. Please note that this action is permanent.",
  "who invented the telephone?": "The telephone was invented by Alexander Graham Bell in 1876.",
  "what is the capital of Australia?": "Canberra is the capital of Australia.",
  "how do I change my notification preferences?": "You can change your notification preferences by going to 'Notification Settings' in your account settings.",
  "what is the largest desert in the world?": "The largest desert in the world is the Antarctic Desert.",
  "who is known as the father of modern physics?": "Albert Einstein is known as the father of modern physics.",
  "what is the longest river in the world?": "The Nile River is often considered the longest river in the world, although some argue that the Amazon River is longer depending on how measurements are taken.",
  "how do I track my delivery?": "You can track your delivery using the tracking number sent to your email or by visiting the carrier's website.",
  "what is the chemical formula for methane?": "The chemical formula for methane is CH4.",
  "How can I update my shipping address after placing an order?": "You can update your shipping address from your account settings, or contact customer support if the order is already placed.",
  "What payment methods do you accept?": "We accept credit/debit cards, PayPal, and select digital wallets.",
  "Can I return an item without the original packaging?": "Returns without original packaging may be accepted but could be subject to a restocking fee.",
  "How long does it take to process a refund?": "Refunds typically take 5-7 business days to appear in your account.",
  "What is the difference between RAM and ROM?": "RAM is temporary memory used by the system for active tasks, while ROM is permanent memory that stores firmware.",
  "How do I reset my router to factory settings?": "Hold down the reset button on the back of the router for about 10 seconds until it restarts.",
  "What is a VPN and why should I use one?": "A VPN encrypts your internet connection, providing privacy and security when browsing online.",
  "How do I check my computer’s IP address?": "On Windows, open Command Prompt and type 'ipconfig'. On macOS, use 'ifconfig' in Terminal.",
  "What is Newton's third law of motion?": "For every action, there is an equal and opposite reaction.",
  "How does photosynthesis work in plants?": "Plants use sunlight, water, and carbon dioxide to create oxygen and glucose through photosynthesis.",
  "Who was the first President of the United States?": "George Washington was the first President, serving from 1789 to 1797.",
  "What is the capital of Australia?": "The capital of Australia is Canberra.",
  "In which year did the Titanic sink?": "The Titanic sank in 1912.",
  "Which planet is known as the Red Planet?": "Mars is known as the Red Planet due to its reddish appearance.",
  "What is the tallest mountain in the world?": "Mount Everest is the tallest mountain, standing at 8,848 meters (29,029 feet).",
  "How many hearts does an octopus have?": "An octopus has three hearts.",
  "Which language has the most native speakers?": "Mandarin Chinese has the most native speakers globally.",
  "What is the hardest natural substance on Earth?": "Diamond is the hardest natural substance.",
  "Which is a type of Electrically-Erasable Programmable Read-Only Memory?":"Flash",
  "The purpose of choke in tube light is ?":"To increase the voltage momentarily",
  "'.MPG' extension refers usually to what kind of file?":"Animation/movie file",
  "Who developed Yahoo?":"David Filo & Jerry Yang",
  "Made from a variety of materials, such as carbon, which inhibits the flow of current?":"Resistor",
  "The most common format for a home video recorder is VHS. VHS stands for?":"Video Home System",
  "What does VVVF stand for?":"Variable Voltage Variable Frequency",
  "":""
}
